{
    "modelTopology": {
        "class_name": "Sequential",
        "config": {
            "name": "age_gender_model",
            "layers": [
                {
                    "class_name": "InputLayer",
                    "config": {
                        "batch_input_shape": [null, 224, 224, 3],
                        "dtype": "float32",
                        "sparse": false,
                        "ragged": false,
                        "name": "input_1"
                    }
                },
                {
                    "class_name": "Conv2D",
                    "config": {
                        "name": "conv2d_1",
                        "trainable": true,
                        "dtype": "float32",
                        "filters": 32,
                        "kernel_size": [3, 3],
                        "strides": [2, 2],
                        "padding": "same",
                        "data_format": "channels_last",
                        "dilation_rate": [1, 1],
                        "groups": 1,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {"seed": null}
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        }
                    }
                },
                {
                    "class_name": "GlobalAveragePooling2D",
                    "config": {
                        "name": "global_average_pooling2d_1",
                        "trainable": true,
                        "dtype": "float32",
                        "data_format": "channels_last"
                    }
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_1",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 1,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {"seed": null}
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        }
                    }
                }
            ]
        },
        "keras_version": "2.12.0",
        "backend": "tensorflow"
    },
    "weightsManifest": [
        {
            "paths": ["age_gender_model-shard1"],
            "weights": [
                {
                    "name": "conv2d_1/kernel",
                    "shape": [3, 3, 3, 32],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_1/bias",
                    "shape": [32],
                    "dtype": "float32"
                },
                {
                    "name": "dense_1/kernel",
                    "shape": [32, 1],
                    "dtype": "float32"
                },
                {
                    "name": "dense_1/bias",
                    "shape": [1],
                    "dtype": "float32"
                }
            ]
        }
    ],
    "format": "layers-model",
    "generatedBy": "keras-js",
    "convertedBy": null
} 